### Import the necessary libraries

In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

### Import the dataset

In [3]:
#Reading and importing dataset
dataset=pd.read_csv("Churn_Modelling.csv")
dataset

#If dataset is not in the same directory
#dataset=pd.read_csv(r"/Churn_Modelling.csv")

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,1,15634602,Hargrave,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,2,15647311,Hill,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,3,15619304,Onio,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,4,15701354,Boni,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,5,15737888,Mitchell,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9995,9996,15606229,Obijiaku,771,France,Male,39,5,0.00,2,1,0,96270.64,0
9996,9997,15569892,Johnstone,516,France,Male,35,10,57369.61,1,1,1,101699.77,0
9997,9998,15584532,Liu,709,France,Female,36,7,0.00,1,0,1,42085.58,1
9998,9999,15682355,Sabbatini,772,Germany,Male,42,3,75075.31,2,1,0,92888.52,1
9999,10000,15628319,Walker,792,France,Female,28,4,130142.79,1,1,0,38190.78,0

In [4]:
#Returning first 3 records
dataset.head(3)

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,1,15634602,Hargrave,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,2,15647311,Hill,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,3,15619304,Onio,502,France,Female,42,8,159660.80,3,1,0,113931.57,1

In [5]:
#Returning last 3 records
dataset.tail(3)

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
9997,9998,15584532,Liu,709,France,Female,36,7,0.00,1,0,1,42085.58,1
9998,9999,15682355,Sabbatini,772,Germany,Male,42,3,75075.31,2,1,0,92888.52,1
9999,10000,15628319,Walker,792,France,Female,28,4,130142.79,1,1,0,38190.78,0

In [6]:
#Returning schematic of the dataset
dataset.shape

(10000, 14)

In [7]:
#Returning information of the dataset
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 14 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   RowNumber        10000 non-null  int64
 1   CustomerId       10000 non-null  int64
 2   Surname          10000 non-null  object
 3   CreditScore      10000 non-null  int64
 4   Geography        10000 non-null  object
 5   Gender           10000 non-null  object
 6   Age              10000 non-null  int64
 7   Tenure           10000 non-null  int64
 8   Balance          10000 non-null  float64
 9   NumOfProducts    10000 non-null  int64
 10  HasCrCard        10000 non-null  int64
 11  IsActiveMember   10000 non-null  int64
 12  EstimatedSalary  10000 non-null  float64
 13  Exited           10000 non-null  int64
dtypes: float64(2), int64(9), object(3)
memory usage: 1.1+ MB

In [8]:
#Returning descrptive statistics of dataset
dataset.describe()

,RowNumber,CustomerId,CreditScore,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
count,10000.00000,1.000000e+04,10000.000000,10000.000000,10000.000000,10000.000000,10000.000000,10000.00000,10000.000000,10000.000000,10000.000000
mean,5000.50000,1.569094e+07,650.528800,38.921800,5.012800,76485.889288,1.530200,0.70550,0.515100,100090.239881,0.203700
std,2886.89568,7.193619e+04,96.653299,10.487806,2.892174,62397.405202,0.581654,0.45584,0.499797,57510.492818,0.402769
min,1.00000,1.556570e+07,350.000000,18.000000,0.000000,0.000000,1.000000,0.00000,0.000000,11.580000,0.000000
25%,2500.75000,1.562853e+07,584.000000,32.000000,3.000000,0.000000,1.000000,0.00000,0.000000,51002.110000,0.000000
50%,5000.50000,1.569074e+07,652.000000,37.000000,5.000000,97198.540000,1.000000,1.00000,1.000000,100193.915000,0.000000
75%,7500.25000,1.575323e+07,718.000000,44.000000,7.000000,127644.240000,2.000000,1.00000,1.000000,149388.247500,0.000000
max,10000.00000,1.581569e+07,850.000000,92.000000,10.000000,250898.090000,4.000000,1.00000,1.000000,199992.480000,1.000000

In [9]:
# Returns correlation matrix
corr=dataset.corr()
corr

/var/folders/ql/xm78crnd19l9q048s8b3qcv00000gn/T/ipykernel_42849/3758495063.py:2: FutureWarning: The default value of numeric_only in DataFrame.corr is deprecated. In a future version, it will default to False. Select only valid columns or specify the value of numeric_only to silence this warning.
  corr=dataset.corr()

,RowNumber,CustomerId,CreditScore,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
RowNumber,1.000000,0.004202,0.005840,0.000783,-0.006495,-0.009067,0.007246,0.000599,0.012044,-0.005988,-0.016571
CustomerId,0.004202,1.000000,0.005308,0.009497,-0.014883,-0.012419,0.016972,-0.014025,0.001665,0.015271,-0.006248
CreditScore,0.005840,0.005308,1.000000,-0.003965,0.000842,0.006268,0.012238,-0.005458,0.025651,-0.001384,-0.027094
Age,0.000783,0.009497,-0.003965,1.000000,-0.009997,0.028308,-0.030680,-0.011721,0.085472,-0.007201,0.285323
Tenure,-0.006495,-0.014883,0.000842,-0.009997,1.000000,-0.012254,0.013444,0.022583,-0.028362,0.007784,-0.014001
Balance,-0.009067,-0.012419,0.006268,0.028308,-0.012254,1.000000,-0.304180,-0.014858,-0.010084,0.012797,0.118533
NumOfProducts,0.007246,0.016972,0.012238,-0.030680,0.013444,-0.304180,1.000000,0.003183,0.009612,0.014204,-0.047820
HasCrCard,0.000599,-0.014025,-0.005458,-0.011721,0.022583,-0.014858,0.003183,1.000000,-0.011866,-0.009933,-0.007138
IsActiveMember,0.012044,0.001665,0.025651,0.085472,-0.028362,-0.010084,0.009612,-0.011866,1.000000,-0.011421,-0.156128
EstimatedSalary,-0.005988,0.015271,-0.001384,-0.007201,0.007784,0.012797,0.014204,-0.009933,-0.011421,1.000000,0.012097
Exited,-0.016571,-0.006248,-0.027094,0.285323,-0.014001,0.118533,-0.047820,-0.007138,-0.156128,0.012097,1.000000

In [10]:
#Checking Number of values
dataset.Gender.value_counts()

Male      5457
Female    4543
Name: Gender, dtype: int64

### Handling null values

1. Delete the NAN
2. Delete row or column
3. Imputting values (Replacing with mean, median or mode values)

In [11]:
#Checking if null values exist in the dataset
dataset.isnull().any()

RowNumber          False
CustomerId         False
Surname            False
CreditScore        False
Geography          False
Gender             False
Age                False
Tenure             False
Balance            False
NumOfProducts      False
HasCrCard          False
IsActiveMember     False
EstimatedSalary    False
Exited             False
dtype: bool

In [12]:
#Checking the number of null values in the dataset
dataset.isnull().sum()

RowNumber          0
CustomerId         0
Surname            0
CreditScore        0
Geography          0
Gender             0
Age                0
Tenure             0
Balance            0
NumOfProducts      0
HasCrCard          0
IsActiveMember     0
EstimatedSalary    0
Exited             0
dtype: int64

If null values existed:

1. dataset["Age"].fillna(dataset["Age"].mean(),inplace=True) -> Numerical
2. dataset["Gender"].fillna(dataset["Gender"].mode(),inplace=True) -> Categorical

### Detecting outliers

Clearly, From the above boxplot, we have the presence of outliers

### Seperating dependent and Independent variables

In [14]:
dataset.head()

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,1,15634602,Hargrave,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,2,15647311,Hill,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,3,15619304,Onio,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,4,15701354,Boni,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,5,15737888,Mitchell,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0

In [15]:
#Selecting dependent variables
x=dataset.iloc[:,3:13]
x

,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary
0,619,France,Female,42,2,0.00,1,1,1,101348.88
1,608,Spain,Female,41,1,83807.86,1,0,1,112542.58
2,502,France,Female,42,8,159660.80,3,1,0,113931.57
3,699,France,Female,39,1,0.00,2,0,0,93826.63
4,850,Spain,Female,43,2,125510.82,1,1,1,79084.10
...,...,...,...,...,...,...,...,...,...,...
9995,771,France,Male,39,5,0.00,2,1,0,96270.64
9996,516,France,Male,35,10,57369.61,1,1,1,101699.77
9997,709,France,Female,36,7,0.00,1,0,1,42085.58
9998,772,Germany,Male,42,3,75075.31,2,1,0,92888.52
9999,792,France,Female,28,4,130142.79,1,1,0,38190.78

In [16]:
#Selecting independent variables
y=dataset.iloc[:,13:14]
y

      Exited
0          1
1          0
2          1
3          0
4          0
...      ...
9995       0
9996       0
9997       1
9998       1
9999       0

[10000 rows x 1 columns]

In [17]:
x.head()

,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary
0,619,France,Female,42,2,0.00,1,1,1,101348.88
1,608,Spain,Female,41,1,83807.86,1,0,1,112542.58
2,502,France,Female,42,8,159660.80,3,1,0,113931.57
3,699,France,Female,39,1,0.00,2,0,0,93826.63
4,850,Spain,Female,43,2,125510.82,1,1,1,79084.10

In [18]:
y.head()

   Exited
0       1
1       0
2       1
3       0
4       0

In [19]:
x.shape

(10000, 10)

In [20]:
y.shape

(10000, 1)

### Encoding

Involves converting of categorical variables into machine language

Types of encoding:

1. Nominal -> Arrangement of data is not important.

2. Ordinal -> Arrangement of data is important.

#####  Types of  Nominal encoding

1. one hot encoding
2. one hot encoding with many categeorical variables
3. mean encoding

##### Types of Ordinal encoding

1. label encoding
2. Target guided ordinal encoding

#### Label encoding

1. encodes data labels by assinging it to integers

In [21]:
#Importing preprocessing
from sklearn import preprocessing

In [22]:
le = preprocessing.LabelEncoder()

In [23]:
#Encoding depedent variable gender
x["Gender"]=le.fit_transform(x["Gender"])
x["Gender"]

0       0
1       0
2       0
3       0
4       0
       ..
9995    1
9996    1
9997    0
9998    1
9999    0
Name: Gender, Length: 10000, dtype: int64

In [24]:
#Gender column has been encoded
x.head()

,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary
0,619,France,0,42,2,0.00,1,1,1,101348.88
1,608,Spain,0,41,1,83807.86,1,0,1,112542.58
2,502,France,0,42,8,159660.80,3,1,0,113931.57
3,699,France,0,39,1,0.00,2,0,0,93826.63
4,850,Spain,0,43,2,125510.82,1,1,1,79084.10

#### One hot encoding

1. Converts categorical values into binary values to indentify them

   Geography France Germany Spain
1. France       1      0      0
2. Germany      0      1      0
3. Spain        0      0      1

In [25]:
#checking shape of x
x.shape

(10000, 10)

In [26]:
#Creating dummy variable
geography=pd.get_dummies(x["Geography"],drop_first=True)
geography

      Germany  Spain
0           0      0
1           0      1
2           0      0
3           0      0
4           0      1
...       ...    ...
9995        0      0
9996        0      0
9997        0      0
9998        1      0
9999        0      0

[10000 rows x 2 columns]

In [27]:
#Concatenating above result to data
x=pd.concat([x,geography],axis=1)
x.head()

,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Germany,Spain
0,619,France,0,42,2,0.00,1,1,1,101348.88,0,0
1,608,Spain,0,41,1,83807.86,1,0,1,112542.58,0,1
2,502,France,0,42,8,159660.80,3,1,0,113931.57,0,0
3,699,France,0,39,1,0.00,2,0,0,93826.63,0,0
4,850,Spain,0,43,2,125510.82,1,1,1,79084.10,0,1

In [28]:
#Since we have encoded, we can remove geography column
x.drop(['Geography'],axis=1,inplace=True)
x.head()

,CreditScore,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Germany,Spain
0,619,0,42,2,0.00,1,1,1,101348.88,0,0
1,608,0,41,1,83807.86,1,0,1,112542.58,0,1
2,502,0,42,8,159660.80,3,1,0,113931.57,0,0
3,699,0,39,1,0.00,2,0,0,93826.63,0,0
4,850,0,43,2,125510.82,1,1,1,79084.10,0,1

### Splitting into training and testing set

1. Training data: 70%-80% of data
2. Testing data: 20%-30%

In [29]:
from sklearn.model_selection import train_test_split

In [30]:
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.3,random_state=0)

In [31]:
#Checking shape of training and testing variables
x_train.shape,x_test.shape,y_train.shape,y_test.shape

((7000, 11), (3000, 11), (7000, 1), (3000, 1))

In [32]:
#with random state
a=[1,2,3,4,5,6]
b=[1,0,1,5,6,3]

for i in range(5):
    a_train,a_test,b_train,b_test=train_test_split(a,b,test_size=0.3,random_state=0)
    print("with random state",a_train)

with random state [2, 4, 1, 5]
with random state [2, 4, 1, 5]
with random state [2, 4, 1, 5]
with random state [2, 4, 1, 5]
with random state [2, 4, 1, 5]

1. In the above snippet, 4 variables are taken for training and 2 for testing from a.
2. random=0, ensures the test variables are left alone. If not, all variables will be randomly picked for training.

In [33]:
#without random state
a=[1,2,3,4,5,6]
b=[1,0,1,5,6,3]

for i in range(5):
    a_train,a_test,b_train,b_test=train_test_split(a,b,test_size=0.3)
    print("with random state",a_train)

with random state [1, 3, 6, 2]
with random state [5, 3, 6, 4]
with random state [5, 4, 3, 1]
with random state [5, 2, 6, 1]
with random state [2, 6, 4, 5]

### Feature scaling

1. Used to transform different scales of data into same type
2. Ensures better performance of model and equal contribution of data

#### Types of feature scaling

1. Standard scaling
2. Min - max scaling

#### Standard scaling

In [34]:
from sklearn.preprocessing import StandardScaler
sc=StandardScaler()

In [35]:
#Transforming training variables to a standard scale
x_train=sc.fit_transform(x_train)
x_train

array([[-0.09792126,  0.92295821, -0.55759842, ..., -0.76862426,
        -0.56987189, -0.5731713 ],
       [-1.12612023,  0.92295821,  0.01725942, ..., -1.39359887,
        -0.56987189, -0.5731713 ],
       [-0.62230274, -1.08347268,  3.5622161 , ..., -1.49739308,
        -0.56987189, -0.5731713 ],
       ...,
       [ 0.89943174,  0.92295821, -0.36597914, ...,  1.41400417,
        -0.56987189, -0.5731713 ],
       [-0.62230274, -1.08347268, -0.07855022, ...,  0.84625811,
        -0.56987189,  1.74467913],
       [-0.28299708, -1.08347268,  0.87954618, ...,  0.32689267,
         1.75478035, -0.5731713 ]])

In [36]:
#Transforming testing variables to a standard scale
x_test=sc.fit_transform(x_test)
x_test

array([[-0.56233235, -1.12586575, -0.39245718, ...,  1.61444413,
         1.66826321, -0.57529746],
       [-1.33954221, -1.12586575,  0.07928396, ...,  0.496527  ,
        -0.59942579, -0.57529746],
       [ 0.58247678, -1.12586575,  0.26798041, ..., -0.4265498 ,
        -0.59942579,  1.7382312 ],
       ...,
       [ 0.36191723,  0.88820536,  0.07928396, ...,  1.17089933,
        -0.59942579, -0.57529746],
       [ 0.43543708,  0.88820536,  2.81538255, ..., -0.51163936,
        -0.59942579, -0.57529746],
       [ 0.84504769, -1.12586575,  0.928418  , ..., -1.15798768,
         1.66826321, -0.57529746]])

## Model Building - ANN

1. Collection of data
2. Data preprocessing
    1. Handling null values
    2. Encode
    3. Split dependent and independent variables
    4. Split training and testing set
    5. Feature scaling
3. Model building
    1. Import libraries (Tensorflow and keras)
    2. Add the input later (Inputs, Weights, Activation function)
    3. Add hidden layer (Inputs, Weights, Activation function)
    4. Add output layer (Inputs, Weights, Activation function)
    5. Configure my learning process (Loss function, Accuracy, Optimizer)
    6. Fit the model  (x_train,y_train,batch_size,epochs)
4. Prediction
5. Find accuracy
6. Random value prediction
7. Outlier detection/ hyperparameter tuning (If model is not performing well)

### Importing libraries

In [ ]:
!pip install --upgrade pip

In [ ]:
!pip install tensorflow

In [ ]:
!pip install keras

In [37]:
from keras.models import Sequential

In [38]:
from keras.layers import Dense

In [39]:
#Initilializing model
model=Sequential()

### Adding input later

In [40]:
model.add(Dense(units=11,activation="relu",kernel_initializer="random_uniform"))

### Adding hidden layer - 2 layers here

In [41]:
model.add(Dense(units=6,activation="relu",kernel_initializer="random_uniform"))

In [42]:
model.add(Dense(units=6,activation="relu",kernel_initializer="random_uniform"))

### Adding output later

In [43]:
model.add(Dense(units=1,activation="sigmoid",kernel_initializer="random_uniform"))

### Configure the learning process

In [44]:
#(loss function, accuracy, optimizer)
model.compile(loss="binary_crossentropy",optimizer="adam",metrics=["accuracy"])

### Fitting the model on training data

In [45]:
model.fit(x_train,y_train,epochs=100,batch_size=32)

Epoch 1/100

2023-10-09 23:35:52.362110: W tensorflow/tsl/platform/profile_utils/cpu_utils.cc:128] Failed to get CPU frequency: 0 Hz

219/219 [==============================] - 0s 436us/step - loss: 0.5677 - accuracy: 0.7964
Epoch 2/100
219/219 [==============================] - 0s 394us/step - loss: 0.4365 - accuracy: 0.7977
Epoch 3/100
219/219 [==============================] - 0s 393us/step - loss: 0.4296 - accuracy: 0.7977
Epoch 4/100
219/219 [==============================] - 0s 392us/step - loss: 0.4257 - accuracy: 0.7977
Epoch 5/100
219/219 [==============================] - 0s 401us/step - loss: 0.4222 - accuracy: 0.7977
Epoch 6/100
219/219 [==============================] - 0s 408us/step - loss: 0.4195 - accuracy: 0.7980
Epoch 7/100
219/219 [==============================] - 0s 408us/step - loss: 0.4174 - accuracy: 0.8203
Epoch 8/100
219/219 [==============================] - 0s 402us/step - loss: 0.4165 - accuracy: 0.8220
Epoch 9/100
219/219 [==============================] - 0s 400us/step - loss: 0.4153 - accuracy: 0.8260
Epoch 10/100
219/219 [==============================] - 0s 405us/step - loss: 0.4147 - accuracy: 0.8257
Epoch 11/100
219/219 [==============================] - 0s 409us/step - loss: 0.4137 - accuracy: 0.8319
Epoch 12/100
219/219 [==============================] - 0s 413us/step - loss: 0.4130 - accuracy: 0.8320
Epoch 13/100
219/219 [==============================] - 0s 395us/step - loss: 0.4118 - accuracy: 0.8317
Epoch 14/100
219/219 [==============================] - 0s 399us/step - loss: 0.4113 - accuracy: 0.8323
Epoch 15/100
219/219 [==============================] - 0s 400us/step - loss: 0.4106 - accuracy: 0.8334
Epoch 16/100
219/219 [==============================] - 0s 402us/step - loss: 0.4102 - accuracy: 0.8344
Epoch 17/100
219/219 [==============================] - 0s 406us/step - loss: 0.4091 - accuracy: 0.8344
Epoch 18/100
219/219 [==============================] - 0s 393us/step - loss: 0.4088 - accuracy: 0.8344
Epoch 19/100
219/219 [==============================] - 0s 389us/step - loss: 0.4081 - accuracy: 0.8340
Epoch 20/100
219/219 [==============================] - 0s 393us/step - loss: 0.4075 - accuracy: 0.8360
Epoch 21/100
219/219 [==============================] - 0s 418us/step - loss: 0.4072 - accuracy: 0.8346
Epoch 22/100
219/219 [==============================] - 0s 402us/step - loss: 0.4065 - accuracy: 0.8354
Epoch 23/100
219/219 [==============================] - 0s 397us/step - loss: 0.4067 - accuracy: 0.8340
Epoch 24/100
219/219 [==============================] - 0s 414us/step - loss: 0.4053 - accuracy: 0.8356
Epoch 25/100
219/219 [==============================] - 0s 398us/step - loss: 0.4054 - accuracy: 0.8361
Epoch 26/100
219/219 [==============================] - 0s 394us/step - loss: 0.4047 - accuracy: 0.8366
Epoch 27/100
219/219 [==============================] - 0s 393us/step - loss: 0.4043 - accuracy: 0.8351
Epoch 28/100
219/219 [==============================] - 0s 399us/step - loss: 0.4041 - accuracy: 0.8360
Epoch 29/100
219/219 [==============================] - 0s 394us/step - loss: 0.4034 - accuracy: 0.8367
Epoch 30/100
219/219 [==============================] - 0s 400us/step - loss: 0.4032 - accuracy: 0.8373
Epoch 31/100
219/219 [==============================] - 0s 393us/step - loss: 0.4032 - accuracy: 0.8347
Epoch 32/100
219/219 [==============================] - 0s 396us/step - loss: 0.4024 - accuracy: 0.8367
Epoch 33/100
219/219 [==============================] - 0s 403us/step - loss: 0.4022 - accuracy: 0.8354
Epoch 34/100
219/219 [==============================] - 0s 405us/step - loss: 0.4018 - accuracy: 0.8370
Epoch 35/100
219/219 [==============================] - 0s 398us/step - loss: 0.4018 - accuracy: 0.8357
Epoch 36/100
219/219 [==============================] - 0s 400us/step - loss: 0.4015 - accuracy: 0.8353
Epoch 37/100
219/219 [==============================] - 0s 400us/step - loss: 0.4007 - accuracy: 0.8357
Epoch 38/100
219/219 [==============================] - 0s 401us/step - loss: 0.4011 - accuracy: 0.8364
Epoch 39/100
219/219 [==============================] - 0s 398us/step - loss: 0.4007 - accuracy: 0.8374
Epoch 40/100
219/219 [==============================] - 0s 402us/step - loss: 0.4002 - accuracy: 0.8364
Epoch 41/100
219/219 [==============================] - 0s 392us/step - loss: 0.4007 - accuracy: 0.8376
Epoch 42/100
219/219 [==============================] - 0s 405us/step - loss: 0.3999 - accuracy: 0.8360
Epoch 43/100
219/219 [==============================] - 0s 403us/step - loss: 0.3994 - accuracy: 0.8353
Epoch 44/100
219/219 [==============================] - 0s 401us/step - loss: 0.3997 - accuracy: 0.8370
Epoch 45/100
219/219 [==============================] - 0s 397us/step - loss: 0.3996 - accuracy: 0.8369
Epoch 46/100
219/219 [==============================] - 0s 396us/step - loss: 0.3995 - accuracy: 0.8380
Epoch 47/100
219/219 [==============================] - 0s 401us/step - loss: 0.3989 - accuracy: 0.8359
Epoch 48/100
219/219 [==============================] - 0s 397us/step - loss: 0.3988 - accuracy: 0.8377
Epoch 49/100
219/219 [==============================] - 0s 406us/step - loss: 0.3985 - accuracy: 0.8366
Epoch 50/100
219/219 [==============================] - 0s 400us/step - loss: 0.3980 - accuracy: 0.8387
Epoch 51/100
219/219 [==============================] - 0s 411us/step - loss: 0.3979 - accuracy: 0.8374
Epoch 52/100
219/219 [==============================] - 0s 395us/step - loss: 0.3983 - accuracy: 0.8356
Epoch 53/100
219/219 [==============================] - 0s 401us/step - loss: 0.3977 - accuracy: 0.8357
Epoch 54/100
219/219 [==============================] - 0s 399us/step - loss: 0.3981 - accuracy: 0.8380
Epoch 55/100
219/219 [==============================] - 0s 391us/step - loss: 0.3973 - accuracy: 0.8366
Epoch 56/100
219/219 [==============================] - 0s 395us/step - loss: 0.3979 - accuracy: 0.8377
Epoch 57/100
219/219 [==============================] - 0s 397us/step - loss: 0.3970 - accuracy: 0.8373
Epoch 58/100
219/219 [==============================] - 0s 396us/step - loss: 0.3971 - accuracy: 0.8379
Epoch 59/100
219/219 [==============================] - 0s 393us/step - loss: 0.3971 - accuracy: 0.8367
Epoch 60/100
219/219 [==============================] - 0s 393us/step - loss: 0.3966 - accuracy: 0.8364
Epoch 61/100
219/219 [==============================] - 0s 398us/step - loss: 0.3972 - accuracy: 0.8364
Epoch 62/100
219/219 [==============================] - 0s 389us/step - loss: 0.3969 - accuracy: 0.8374
Epoch 63/100
219/219 [==============================] - 0s 388us/step - loss: 0.3968 - accuracy: 0.8387
Epoch 64/100
219/219 [==============================] - 0s 391us/step - loss: 0.3963 - accuracy: 0.8379
Epoch 65/100
219/219 [==============================] - 0s 388us/step - loss: 0.3962 - accuracy: 0.8374
Epoch 66/100
219/219 [==============================] - 0s 394us/step - loss: 0.3963 - accuracy: 0.8381
Epoch 67/100
219/219 [==============================] - 0s 392us/step - loss: 0.3963 - accuracy: 0.8371
Epoch 68/100
219/219 [==============================] - 0s 388us/step - loss: 0.3963 - accuracy: 0.8379
Epoch 69/100
219/219 [==============================] - 0s 388us/step - loss: 0.3961 - accuracy: 0.8387
Epoch 70/100
219/219 [==============================] - 0s 410us/step - loss: 0.3960 - accuracy: 0.8349
Epoch 71/100
219/219 [==============================] - 0s 395us/step - loss: 0.3961 - accuracy: 0.8370
Epoch 72/100
219/219 [==============================] - 0s 386us/step - loss: 0.3958 - accuracy: 0.8373
Epoch 73/100
219/219 [==============================] - 0s 391us/step - loss: 0.3957 - accuracy: 0.8357
Epoch 74/100
219/219 [==============================] - 0s 396us/step - loss: 0.3960 - accuracy: 0.8381
Epoch 75/100
219/219 [==============================] - 0s 392us/step - loss: 0.3956 - accuracy: 0.8371
Epoch 76/100
219/219 [==============================] - 0s 391us/step - loss: 0.3959 - accuracy: 0.8367
Epoch 77/100
219/219 [==============================] - 0s 391us/step - loss: 0.3956 - accuracy: 0.8361
Epoch 78/100
219/219 [==============================] - 0s 396us/step - loss: 0.3957 - accuracy: 0.8390
Epoch 79/100
219/219 [==============================] - 0s 395us/step - loss: 0.3945 - accuracy: 0.8384

Epoch 80/100
219/219 [==============================] - 0s 398us/step - loss: 0.3956 - accuracy: 0.8363
Epoch 81/100
219/219 [==============================] - 0s 383us/step - loss: 0.3951 - accuracy: 0.8380
Epoch 82/100
219/219 [==============================] - 0s 388us/step - loss: 0.3947 - accuracy: 0.8367
Epoch 83/100
219/219 [==============================] - 0s 384us/step - loss: 0.3957 - accuracy: 0.8361
Epoch 84/100
219/219 [==============================] - 0s 385us/step - loss: 0.3947 - accuracy: 0.8379
Epoch 85/100
219/219 [==============================] - 0s 381us/step - loss: 0.3949 - accuracy: 0.8369
Epoch 86/100
219/219 [==============================] - 0s 388us/step - loss: 0.3950 - accuracy: 0.8367
Epoch 87/100
219/219 [==============================] - 0s 389us/step - loss: 0.3949 - accuracy: 0.8364
Epoch 88/100
219/219 [==============================] - 0s 386us/step - loss: 0.3952 - accuracy: 0.8369
Epoch 89/100
219/219 [==============================] - 0s 402us/step - loss: 0.3948 - accuracy: 0.8369
Epoch 90/100
219/219 [==============================] - 0s 474us/step - loss: 0.3947 - accuracy: 0.8370
Epoch 91/100
219/219 [==============================] - 0s 383us/step - loss: 0.3951 - accuracy: 0.8380
Epoch 92/100
219/219 [==============================] - 0s 385us/step - loss: 0.3946 - accuracy: 0.8364
Epoch 93/100
219/219 [==============================] - 0s 384us/step - loss: 0.3946 - accuracy: 0.8363
Epoch 94/100
219/219 [==============================] - 0s 389us/step - loss: 0.3947 - accuracy: 0.8373
Epoch 95/100
219/219 [==============================] - 0s 386us/step - loss: 0.3947 - accuracy: 0.8369
Epoch 96/100
219/219 [==============================] - 0s 385us/step - loss: 0.3946 - accuracy: 0.8383
Epoch 97/100
219/219 [==============================] - 0s 386us/step - loss: 0.3943 - accuracy: 0.8376
Epoch 98/100
219/219 [==============================] - 0s 385us/step - loss: 0.3947 - accuracy: 0.8369
Epoch 99/100
219/219 [==============================] - 0s 383us/step - loss: 0.3948 - accuracy: 0.8366
Epoch 100/100
219/219 [==============================] - 0s 381us/step - loss: 0.3946 - accuracy: 0.8377

x_train -> 7000 records

Batch size -> Divides the training data into 32 batches, for each epoch 7000/32 data is considered.

In [46]:
#Checking layers of model
model.summary()

Model: "sequential"
_________________________________________________________________
 Layer (type)                Output Shape              Param #
=================================================================
 dense (Dense)               (None, 11)                132

 dense_1 (Dense)             (None, 6)                 72

 dense_2 (Dense)             (None, 6)                 42

 dense_3 (Dense)             (None, 1)                 7

=================================================================
Total params: 253
Trainable params: 253
Non-trainable params: 0
_________________________________________________________________

### Prediction

In [47]:
#ypred gives probability of outcome
ypred=model.predict(x_test)
ypred

94/94 [==============================] - 0s 324us/step

array([[0.27606124],
       [0.3521446 ],
       [0.14304219],
       ...,
       [0.11299603],
       [0.04347116],
       [0.4907525 ]], dtype=float32)

Since, we are using sigmoid function

Range is 0 to 1

If y>0.5 -> 1
if y<0.5 -> 0

In [48]:
ypred=np.where(ypred>0.5,1,0)
ypred

array([[0],
       [0],
       [0],
       ...,
       [0],
       [0],
       [0]])

### Accuracy

In [49]:
from sklearn.metrics import accuracy_score
accuracy_score(y_test,ypred)

0.8426666666666667

### saving model

In [50]:
model.save("ann.h5")